rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
#if PRINT_HID_REPORT_DESCRIPTOR == 1
			USBH_UsrLog("Dump HID Report Descriptor start");
			printf("wItemLength %d\n", HID_Handle->HID_Desc.wItemLength);

			for(uint16_t i = 0; i < HID_Handle->HID_Desc.wItemLength; i++){
				printf("0x%02X ", phost->device.Data[i]);
			}

			printf("\n");
			USBH_UsrLog("Dump HID Report Descriptor end");
#endif // #if PRINT_HID_REPORT_DESCRIPTOR == 1

			HID_Handle->ctl_state = HID_REQ_SET_IDLE;
		} else if (classReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: HID: Device Get Report Descriptor request failed");
			status = USBH_FAIL;
		} else {
			/* .. */
		}

		break;

	case HID_REQ_SET_IDLE:

		classReqStatus = USBH_HID_SetIdle(phost, 0U, 0U);

		/* set Idle */
		if (classReqStatus == USBH_OK) {
			HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
		} else {
			if (classReqStatus == USBH_NOT_SUPPORTED) {
				HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
			}
		}
		break;

	case HID_REQ_SET_PROTOCOL:
		/* set protocol */
		classReqStatus = USBH_HID_SetProtocol(phost, 0U);
		if (classReqStatus == USBH_OK) {
			HID_Handle->ctl_state = HID_REQ_IDLE;

			/* all requests performed*/
			phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
			status = USBH_OK;
		} else if (classReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: HID: Device Set protocol request failed");
			status = USBH_FAIL;
		} else {
			/* .. */
		}
		break;
	case HID_REQ_IDLE:
	default:
		break;
	}

	return status;
}

static void USBH_HID_IncrementInterface(USBH_HandleTypeDef *phost) {
	uint8_t max_loop = phost->device.CfgDesc.bNumInterfaces;

	while (max_loop--) {
		// switch interface
		phost->device.current_interface++;

		if (phost->device.current_interface
				>= phost->device.CfgDesc.bNumInterfaces) {
			phost->device.current_interface = 0U;
		}

		if (phost->device.skip_interface == 0U) {
			//USBH_UsrLog("current_interface: %d",
			//		phost->device.current_interface);
			break;
		}
	}
}

static uint8_t USB_Get_Keyboard_LED_Status(USBH_HandleTypeDef *phost) {
	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if (HID_Handle->Init != USBH_HID_KeybdInit) {
		return 0xFF;
	}

	USBH_StatusTypeDef status;

	for (uint8_t timeout = 0U; timeout < 15; timeout++) {
		status = USBH_HID_GetReport(phost, 0x02U, 0U, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0]);

		if (status == USBH_OK) {
			//USBH_UsrLog("USBH_OK USBH_OK");
			return HID_Handle->pData[0];
		}

		USBH_Delay(5);
	}

	return 0xFF;
}

static USBH_StatusTypeDef USB_Set_Keyboard_LED_Status(USBH_HandleTypeDef *phost) {
	if(phost->device.kbd_LED_supported == 0) {
		return HAL_OK;
	}

	if ((phost->Timer - phost->device.kbd_led_status_tick) < 50) {
		return HAL_OK;
	}

	phost->device.kbd_led_status_tick = phost->Timer;

	if (phost->device.kbd_LED_status == 0xFFU) {
		phost->device.kbd_LED_status = 0b001U;
	}

	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if (HID_Handle->Init != USBH_HID_KeybdInit) {
		return HAL_OK;
	}

	uint8_t LED_status = phost->device.kbd_LED_status & 7U;

	uint8_t status_get = USB_Get_Keyboard_LED_Status(phost);

	if ((status_get == 0xFF) || (status_get == LED_status)) {
		return HAL_OK;
	}

	HID_Handle->pData[0] = LED_status;
	HID_Handle->pData[1] = 0;

	USBH_StatusTypeDef status_set;

	for (uint8_t timeout = 0U; timeout < 15U; timeout++) {
		status_set = USBH_HID_SetReport(phost, 0x02U, 0U, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0]);

		if (status_set == USBH_OK) {
			break;
		}

		USBH_Delay(5);
	}

//	if (status_set == USBH_OK) {
//		uint8_t status_get = USB_Get_Keyboard_LED_Status(phost);
//
//		if (status_get == LED_status) {
	return USBH_OK;
//		}
//	}

//	return USBH_NOT_SUPPORTED;
}

/**
 * @brief  USBH_HID_Process
 *         The function is for managing state machine for HID data transfers
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost) {
	USBH_StatusTypeDef status = USBH_OK;

	uint8_t URBState;

	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	uint32_t XferSize;

	switch (HID_Handle->state) {
	case HID_INIT:
		//USBH_UsrLog("HID_INIT");
		HID_Handle->Init(phost);
		HID_Handle->state = HID_IDLE;
		HID_Handle->Timeout = USBH_GetTick();

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_IDLE:
		//USBH_UsrLog("HID_IDLE");
		status = USBH_HID_GetReport(phost, 0x01U, 0U, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0]);
		if (status == USBH_OK) {
//			USBH_UsrLog("status USBH_OK");
			HID_Handle->state = HID_SYNC;
		} else if (status == USBH_BUSY) {
//			USBH_UsrLog("status USBH_BUSY");
			HID_Handle->state = HID_IDLE;
			status = USBH_OK;
		} else if (status == USBH_NOT_SUPPORTED) {
//			USBH_UsrLog("status USBH_NOT_SUPPORTED");
			HID_Handle->state = HID_SYNC;
			status = USBH_OK;
		} else {
//			USBH_UsrLog("status HID_ERROR");
			HID_Handle->state = HID_ERROR;
			status = USBH_FAIL;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_SYNC:
		//USBH_UsrLog("HID_SYNC");
		/* Sync with start of Even Frame */
		if ((phost->Timer & 1U) != 0U) {
			HID_Handle->state = HID_GET_DATA;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

