rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
	case HID_GET_DATA:
		//USBH_UsrLog("HID_GET_DATA");
		(void) USBH_InterruptReceiveData(phost, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0], HID_Handle->InPipe);

		HID_Handle->state = HID_POLL;
		HID_Handle->timer = phost->Timer;
		HID_Handle->DataReady = 0U;
		break;

	case HID_POLL:
		//USBH_UsrLog("HID_POLL");
		URBState = (uint8_t) USBH_LL_GetURBState(phost, HID_Handle->InPipe);

		if (URBState == USBH_URB_DONE) {
			HID_Handle->Timeout = USBH_GetTick(); //0;
			//USBH_UsrLog("USBH_URB_DONE, interface: %d", idx);
			XferSize = USBH_LL_GetLastXferSize(phost, HID_Handle->InPipe);

			if ((HID_Handle->DataReady == 0U) && (XferSize != 0U)) {
				(void) USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData,
						HID_Handle->length_array[0]);
				HID_Handle->DataReady = 1U;
				USBH_HID_EventCallback(phost);

				if (HID_Handle->Init == USBH_HID_KeybdInit) {
					phost->device.kbd_led_status_tick = phost->Timer;
				}

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			}
		} else if (URBState == USBH_URB_STALL) {
			//USBH_UsrLog("USBH_URB_STALL");
			/* Issue Clear Feature on interrupt IN endpoint */
			if (USBH_ClrFeature(phost, HID_Handle->ep_addr_array[0])
					== USBH_OK) {
				/* Change state to issue next IN token */
				HID_Handle->state = HID_GET_DATA;

				// switch interface
				USBH_HID_IncrementInterface(phost);

				// USBH_UsrLog("current_interface: %d",
				//		phost->device.current_interface);
			}

		} else {
			if (URBState == USBH_URB_ERROR) {

				//USBH_ErrLog("USBH_URB_ERROR");
			} else if (URBState == USBH_URB_NOTREADY) {
				// USBH_UsrLog("USBH_URB_NOTREADY");
			} else if (URBState == USBH_URB_NYET) {
				// USBH_UsrLog("USBH_URB_NYET");
			} else {
				if (URBState != USBH_URB_IDLE) {
					USBH_UsrLog("URBState: %d", URBState);
				}
			}

			if (URBState == USBH_URB_IDLE) {
				// USBH_UsrLog("Timer: 0x%08lu", phost->Timer);
				if (HID_Handle->Init == USBH_HID_KeybdInit) {
					USB_Set_Keyboard_LED_Status(phost);
				} else if (HID_Handle->Init == USBH_HID_CustomInit) {
					// vibration feedback
				}
			} else {
				if ((USBH_GetTick() - HID_Handle->Timeout)
						> USBH_DEV_RESET_TIMEOUT) {
					//USBH_UsrLog("USB Configuration Failed, Please unplug the Device.");
					HID_Handle->state = HID_ERROR;
					HID_Handle->Timeout = USBH_GetTick(); //0;
				}
			}
		}
		break;
	case HID_ERROR:
		HID_Handle->state = HID_SYNC;
		USBH_UsrLog("case HID_ERROR");
		// USBH_RecoveryPhost(phost);
		break;
	default:
		break;
	}

	return status;
}

/**
 * @brief  USBH_HID_SOFProcess
 *         The function is for managing the SOF Process
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost) {
	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if (HID_Handle->state == HID_POLL) {
		if ((phost->Timer - HID_Handle->timer) >= HID_Handle->poll_array[0]) {
			HID_Handle->state = HID_GET_DATA;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

			// switch interface
			USBH_HID_IncrementInterface(phost);
		}
	}
	return USBH_OK;
}

/**
 * @brief  USBH_Get_HID_ReportDescriptor
 *         Issue report Descriptor command to the device. Once the response
 *         received, parse the report descriptor and update the status.
 * @param  phost: Host handle
 * @param  Length : HID Report Descriptor Length
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_GetHIDReportDescriptor(USBH_HandleTypeDef *phost,
		uint16_t length) {

	USBH_StatusTypeDef status;

	status = USBH_GetDescriptor(phost,
	USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
	USB_DESC_HID_REPORT, phost->device.Data, length);

	/* HID report descriptor is available in phost->device.Data.
	 In case of USB Boot Mode devices for In report handling ,
	 HID report descriptor parsing is not required.
	 In case, for supporting Non-Boot Protocol devices and output reports,
	 user may parse the report descriptor*/

	return status;
}

/**
 * @brief  USBH_Get_HID_Descriptor
 *         Issue HID Descriptor command to the device. Once the response
 *         received, parse the report descriptor and update the status.
 * @param  phost: Host handle
 * @param  Length : HID Descriptor Length
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_GetHIDDescriptor(USBH_HandleTypeDef *phost,
		uint16_t length) {
	USBH_StatusTypeDef status;

	status = USBH_GetDescriptor(phost,
	USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
	USB_DESC_HID, phost->device.Data, length);

	return status;
}

/**
 * @brief  USBH_Set_Idle
 *         Set Idle State.
 * @param  phost: Host handle
 * @param  duration: Duration for HID Idle request
 * @param  reportId : Targeted report ID for Set Idle request
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_SetIdle(USBH_HandleTypeDef *phost, uint8_t duration,
		uint8_t reportId) {

	phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE
			|
			USB_REQ_TYPE_CLASS;

	phost->Control.setup.b.bRequest = USB_HID_SET_IDLE;
	phost->Control.setup.b.wValue.w = (uint16_t) (((uint32_t) duration << 8U)
			| (uint32_t) reportId);

	phost->Control.setup.b.wIndex.w = 0U;
	phost->Control.setup.b.wLength.w = 0U;

	return USBH_CtlReq(phost, NULL, 0U);
}

/**
 * @brief  USBH_HID_Set_Report
 *         Issues Set Report
 * @param  phost: Host handle
 * @param  reportType  : Report type to be sent
 * @param  reportId    : Targeted report ID for Set Report request
 * @param  reportBuff  : Report Buffer
 * @param  reportLen   : Length of data report to be send
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_SetReport(USBH_HandleTypeDef *phost,
		uint8_t reportType, uint8_t reportId, uint8_t *reportBuff,
		uint8_t reportLen) {

	phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE
			|
			USB_REQ_TYPE_CLASS;

